[
    {
        "base_url": "https://class.coursera.org/gamification-2012-001/",
        "author": "Kevin Werbach",
        "summary": "Gamification is the application of game elements and digital game design techniques to non-game problems, such as business and social impact challenges. This course will teach you the mechanisms of gamification, why it has such tremendous potential, and how to use it effectively."
    },
    {
        "base_url": "https://class.coursera.org/sna-2012-001/",
        "author": "Lada Adamic",
        "summary": "This course will use social network analysis, both its theory and computational tools, to make sense of the social and information networks that have been fueled and rendered accessible by the internet."
    },
    {
        "base_url": "https://class.coursera.org/crypto-2012-002/",
        "author": "Dan Boneh",
        "summary": "Learn about the inner workings of cryptographic primitives and how to apply this knowledge in real-world applications!"
    },
    {
        "base_url": "https://class.coursera.org/pgm-2012-002/",
        "author": "Daphne Koller",
        "summary": "In this class, you will learn the basics of the PGM representation and how to construct them, using both human knowledge and machine learning techniques."
    },
    {
        "base_url": "https://class.coursera.org/neuralnets-2012-001/",
        "author": "Geoffrey Hinton",
        "summary": "Learn about artificial neural networks and how they're being used for machine learning, as applied to speech and object recognition, image segmentation, modeling language and human motion, etc. We'll emphasize both the basic algorithms and the practical tricks needed to get them to work well."
    },
    {
        "base_url": "https://class.coursera.org/compilers-2012-selfservice/",
        "author": "Alex Aiken",
        "summary": "This course will discuss the major ideas used today in the implementation of programming language compilers. You will learn how a program written in a high-level language designed for humans is systematically translated into a program written in low-level assembly more suited to machines!"
    },
    {
        "base_url": "https://class.coursera.org/ml-2012-002/",
        "author": "Andrew NG",
        "summary": "Learn about the most effective machine learning techniques, and gain practice implementing them and getting them to work for yourself."
    },
    {
        "base_url": "https://class.coursera.org/algo2-2012-001/",
        "author": "Tim Roughgarden",
        "summary": "In this course you will learn several fundamental principles of advanced algorithm design: greedy algorithms and applications; dynamic programming and applications; NP-completeness and what it means for the algorithm designer; the design and analysis of heuristics; and more."
    }
]
